###################################################################

# Created by write_sdc on Thu Oct  9 14:15:05 2014

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_model -name TSMC8K_Lowk_Conservative -library tcbn65lptc_ccs
set_max_area 0
set_driving_cell -lib_cell GINVD8 [get_ports reset]
set_driving_cell -lib_cell GINVD8 [get_ports clk]
set_driving_cell -lib_cell GINVD8 [get_ports read]
set_driving_cell -lib_cell GINVD8 [get_ports {read_index[4]}]
set_driving_cell -lib_cell GINVD8 [get_ports {read_index[3]}]
set_driving_cell -lib_cell GINVD8 [get_ports {read_index[2]}]
set_driving_cell -lib_cell GINVD8 [get_ports {read_index[1]}]
set_driving_cell -lib_cell GINVD8 [get_ports {read_index[0]}]
set_driving_cell -lib_cell GINVD8 [get_ports write]
set_driving_cell -lib_cell GINVD8 [get_ports {write_index[4]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_index[3]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_index[2]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_index[1]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_index[0]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[31]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[30]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[29]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[28]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[27]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[26]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[25]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[24]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[23]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[22]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[21]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[20]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[19]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[18]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[17]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[16]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[15]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[14]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[13]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[12]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[11]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[10]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[9]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[8]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[7]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[6]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[5]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[4]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[3]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[2]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[1]}]
set_driving_cell -lib_cell GINVD8 [get_ports {write_data[0]}]
set_driving_cell -lib_cell GINVD8 [get_ports search]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[31]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[30]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[29]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[28]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[27]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[26]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[25]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[24]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[23]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[22]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[21]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[20]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[19]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[18]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[17]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[16]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[15]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[14]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[13]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[12]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[11]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[10]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[9]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[8]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[7]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[6]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[5]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[4]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[3]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[2]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[1]}]
set_driving_cell -lib_cell GINVD8 [get_ports {search_data[0]}]
set_load -pin_load 0.013 [get_ports read_valid]
set_load -pin_load 0.013 [get_ports {read_value[31]}]
set_load -pin_load 0.013 [get_ports {read_value[30]}]
set_load -pin_load 0.013 [get_ports {read_value[29]}]
set_load -pin_load 0.013 [get_ports {read_value[28]}]
set_load -pin_load 0.013 [get_ports {read_value[27]}]
set_load -pin_load 0.013 [get_ports {read_value[26]}]
set_load -pin_load 0.013 [get_ports {read_value[25]}]
set_load -pin_load 0.013 [get_ports {read_value[24]}]
set_load -pin_load 0.013 [get_ports {read_value[23]}]
set_load -pin_load 0.013 [get_ports {read_value[22]}]
set_load -pin_load 0.013 [get_ports {read_value[21]}]
set_load -pin_load 0.013 [get_ports {read_value[20]}]
set_load -pin_load 0.013 [get_ports {read_value[19]}]
set_load -pin_load 0.013 [get_ports {read_value[18]}]
set_load -pin_load 0.013 [get_ports {read_value[17]}]
set_load -pin_load 0.013 [get_ports {read_value[16]}]
set_load -pin_load 0.013 [get_ports {read_value[15]}]
set_load -pin_load 0.013 [get_ports {read_value[14]}]
set_load -pin_load 0.013 [get_ports {read_value[13]}]
set_load -pin_load 0.013 [get_ports {read_value[12]}]
set_load -pin_load 0.013 [get_ports {read_value[11]}]
set_load -pin_load 0.013 [get_ports {read_value[10]}]
set_load -pin_load 0.013 [get_ports {read_value[9]}]
set_load -pin_load 0.013 [get_ports {read_value[8]}]
set_load -pin_load 0.013 [get_ports {read_value[7]}]
set_load -pin_load 0.013 [get_ports {read_value[6]}]
set_load -pin_load 0.013 [get_ports {read_value[5]}]
set_load -pin_load 0.013 [get_ports {read_value[4]}]
set_load -pin_load 0.013 [get_ports {read_value[3]}]
set_load -pin_load 0.013 [get_ports {read_value[2]}]
set_load -pin_load 0.013 [get_ports {read_value[1]}]
set_load -pin_load 0.013 [get_ports {read_value[0]}]
set_load -pin_load 0.013 [get_ports search_valid]
set_load -pin_load 0.013 [get_ports {search_index[4]}]
set_load -pin_load 0.013 [get_ports {search_index[3]}]
set_load -pin_load 0.013 [get_ports {search_index[2]}]
set_load -pin_load 0.013 [get_ports {search_index[1]}]
set_load -pin_load 0.013 [get_ports {search_index[0]}]
create_clock [get_ports clk]  -period 2.5  -waveform {0 1.25}
set_input_delay -clock clk  0.25  [get_ports clk]
set_input_delay -clock clk  0.25  [get_ports reset]
set_input_delay -clock clk  0.25  [get_ports read]
set_input_delay -clock clk  0.25  [get_ports {read_index[4]}]
set_input_delay -clock clk  0.25  [get_ports {read_index[3]}]
set_input_delay -clock clk  0.25  [get_ports {read_index[2]}]
set_input_delay -clock clk  0.25  [get_ports {read_index[1]}]
set_input_delay -clock clk  0.25  [get_ports {read_index[0]}]
set_input_delay -clock clk  0.25  [get_ports write]
set_input_delay -clock clk  0.25  [get_ports {write_index[4]}]
set_input_delay -clock clk  0.25  [get_ports {write_index[3]}]
set_input_delay -clock clk  0.25  [get_ports {write_index[2]}]
set_input_delay -clock clk  0.25  [get_ports {write_index[1]}]
set_input_delay -clock clk  0.25  [get_ports {write_index[0]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[31]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[30]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[29]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[28]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[27]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[26]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[25]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[24]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[23]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[22]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[21]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[20]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[19]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[18]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[17]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[16]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[15]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[14]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[13]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[12]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[11]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[10]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[9]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[8]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[7]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[6]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[5]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[4]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[3]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[2]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[1]}]
set_input_delay -clock clk  0.25  [get_ports {write_data[0]}]
set_input_delay -clock clk  0.25  [get_ports search]
set_input_delay -clock clk  0.25  [get_ports {search_data[31]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[30]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[29]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[28]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[27]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[26]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[25]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[24]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[23]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[22]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[21]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[20]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[19]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[18]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[17]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[16]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[15]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[14]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[13]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[12]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[11]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[10]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[9]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[8]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[7]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[6]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[5]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[4]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[3]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[2]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[1]}]
set_input_delay -clock clk  0.25  [get_ports {search_data[0]}]
set_output_delay -clock clk  0.25  [get_ports read_valid]
set_output_delay -clock clk  0.25  [get_ports {read_value[31]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[30]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[29]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[28]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[27]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[26]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[25]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[24]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[23]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[22]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[21]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[20]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[19]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[18]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[17]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[16]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[15]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[14]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[13]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[12]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[11]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[10]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[9]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[8]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[7]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[6]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[5]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[4]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[3]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[2]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[1]}]
set_output_delay -clock clk  0.25  [get_ports {read_value[0]}]
set_output_delay -clock clk  0.25  [get_ports search_valid]
set_output_delay -clock clk  0.25  [get_ports {search_index[4]}]
set_output_delay -clock clk  0.25  [get_ports {search_index[3]}]
set_output_delay -clock clk  0.25  [get_ports {search_index[2]}]
set_output_delay -clock clk  0.25  [get_ports {search_index[1]}]
set_output_delay -clock clk  0.25  [get_ports {search_index[0]}]
