
Warning:  Site Information is not available ... Have you run install_site?


                      Design Compiler Graphical
                            DC Ultra (TM)
                             DFTMAX (TM)
                         Power Compiler (TM)
                           DesignWare (R)
                           DC Expert (TM)
                         Design Vision (TM)
                          HDL Compiler (TM)
                         VHDL Compiler (TM)
                            DFT Compiler
                        Library Compiler (TM)
                         Design Compiler(R)

           Version F-2011.09-SP2 for amd64 -- Nov 24, 2011
               Copyright (c) 1988-2011 Synopsys, Inc.

This software and the associated documentation are confidential and 
proprietary to Synopsys, Inc. Your use or disclosure of this software 
is subject to the terms and conditions of a written license agreement 
between you, or your company, and Synopsys, Inc.

Initializing...
# ######### Boilerplate ##########################################
# Standard System Level Settings. Do not change.
#################################################################
set SynopsysInstall [getenv "SYNOPSYS"]
/sim/synopsys64/icc
set stdcellhome /sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library/
/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library/
set design_db  $stdcellhome/synopsys/models/saed90nm_typ.db
/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library//synopsys/models/saed90nm_typ.db
set mw_ref_lib $stdcellhome/process/astro/gds-as/saed90nm_dv
/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library//process/astro/gds-as/saed90nm_dv
#set astro_tf   $stdcellhome/process/astro/tech/astroTechFile.tf
set max_tlu    $stdcellhome/process/starrcxt/tluplus/saed90nm_1p9m_1t_Cmax.tluplus
/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library//process/starrcxt/tluplus/saed90nm_1p9m_1t_Cmax.tluplus
set min_tlu    $stdcellhome/process/starrcxt/tluplus/saed90nm_1p9m_1t_Cmin.tluplus
/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library//process/starrcxt/tluplus/saed90nm_1p9m_1t_Cmin.tluplus
set mapf       $stdcellhome/process/star_rcxt/saed90nm.map
/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library//process/star_rcxt/saed90nm.map
set astro_tf /sim/synopsys/SAED_EDK90nm/Technology_Kit/techfile/saed90nm_icc_1p9m.tf
/sim/synopsys/SAED_EDK90nm/Technology_Kit/techfile/saed90nm_icc_1p9m.tf
#   Controls  whether  a  warning  message  is  issued if a latch is
#   inferred from a design.
set mw_logic1_net "VDD"
VDD
set mw_logic0_net "VSS"
VSS
set search_path [list . [format "%s%s" $SynopsysInstall /dw/sim_ver]]
. /sim/synopsys64/icc/dw/sim_ver
set target_library  $design_db
/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library//synopsys/models/saed90nm_typ.db
set synthetic_library [list dw_foundation.sldb]
dw_foundation.sldb
set link_library [concat [concat "*" $target_library] $synthetic_library]
* /sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library//synopsys/models/saed90nm_typ.db dw_foundation.sldb
set symbol_library [list generic.sdb]
generic.sdb
set hdlin_check_no_latch true
true
define_design_lib WORK -path ./WORK
1
##################################################################
# below are parameters that you will want to set for each design 
##################################################################
set RTL_PATH  "./rtl/"
./rtl/
set myFiles [glob $RTL_PATH/*]
./rtl/and_func.sv
set fileFormat sverilog              ;# verilog or sverilog
sverilog
set basename and_func                     ;# Top-level module name
and_func
#set CLK "clk"                  ;# The name of your clock 
set virtual 0                        ;# 1 if virtual clock, 0 if real clock
0
# Timing and loading information                
#set clkPeriod_ns 6     ;# desired clock period (in ns) 
# Input delay tells DC how long after the clock before an input becomes
# valid. 
#set inDelay_ns [expr $clkPeriod_ns*.1]  ;# delay from clock to inputs valid
#set outDelay_ns [expr $clkPeriod_ns*.1] ;# delay from clock to output valid
set inputDrive INVX16 
INVX16
set LoadLib $design_db  ;# name of library the cell comes from
/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library//synopsys/models/saed90nm_typ.db
set myLoadPin "IN"             ;# name of pin that the outputs drive
IN
set CLK_SKEW 0.10
0.10
set CLK_JITTER 0.075
0.075
# Create MW library
set MW_LIB_NAME [format "%s%s" $basename "_LIB"]
and_func_LIB
create_mw_lib -technology $astro_tf -mw_reference_library $mw_ref_lib $MW_LIB_NAME
Start to load technology file /sim/synopsys/SAED_EDK90nm/Technology_Kit/techfile/saed90nm_icc_1p9m.tf.
Information: Non-metal layer 'DIFF_33' has the metal layer attribute 'endOfLineCornerKeepoutWidth'. (line 1577) (TFCHK-046)
Warning: DesignRule attribute 'layer2' is assigned a non-physical layer 'DNW'. (line 1951) (TFCHK-079)
Warning: DesignRule attribute 'layer2' is assigned a non-physical layer 'RPOLY'. (line 2154) (TFCHK-079)
Warning: Layer 'M1' has a pitch 0.32 that does not match the recommended wire-to-via pitch 0.33. (TFCHK-049)
Warning: Layer 'M2' has a pitch 0.32 that does not match the recommended wire-to-via pitch 0.36. (TFCHK-049)
Warning: Layer 'M3' has a pitch 0.32 that does not match the recommended wire-to-via pitch 0.36. (TFCHK-049)
Warning: Layer 'M4' has a pitch 0.32 that does not match the recommended wire-to-via pitch 0.36. (TFCHK-049)
Warning: Layer 'M5' has a pitch 0.32 that does not match the recommended wire-to-via pitch 0.36. (TFCHK-049)
Warning: Layer 'M6' has a pitch 0.32 that does not match the recommended wire-to-via pitch 0.36. (TFCHK-049)
Warning: Layer 'M7' has a pitch 0.32 that does not match the recommended wire-to-via pitch 0.36. (TFCHK-049)
Warning: Layer 'M8' has a pitch 0.32 that does not match the recommended wire-to-via pitch 0.465 or 0.5. (TFCHK-049)
Warning: Layer 'M3' has a pitch 0.32 that does not match the doubled pitch 0.64 or tripled pitch 0.96. (TFCHK-050)
Warning: Layer 'M4' has a pitch 0.32 that does not match the doubled pitch 0.64 or tripled pitch 0.96. (TFCHK-050)
Warning: Layer 'M5' has a pitch 0.32 that does not match the doubled pitch 0.64 or tripled pitch 0.96. (TFCHK-050)
Warning: Layer 'M6' has a pitch 0.32 that does not match the doubled pitch 0.64 or tripled pitch 0.96. (TFCHK-050)
Warning: Layer 'M7' has a pitch 0.32 that does not match the doubled pitch 0.64 or tripled pitch 0.96. (TFCHK-050)
Warning: Layer 'M8' has a pitch 0.32 that does not match the doubled pitch 0.64 or tripled pitch 0.96. (TFCHK-050)
Warning: Layer 'M9' has a pitch 0.9 that does not match the doubled pitch 0.64 or tripled pitch 0.96. (TFCHK-050)
Technology file /sim/synopsys/SAED_EDK90nm/Technology_Kit/techfile/saed90nm_icc_1p9m.tf has been loaded successfully.
open_mw_lib $MW_LIB_NAME
{and_func_LIB}
check_library
No check done. Please specify valid options and libraries and/or use dc_shell-topo, de_shell or icc_shell
0
# Control the writing of result files               
set STAGE synth                ;# Name appended to output files
synth
# the following control which output files you want. They   
# should be set to 1 if you want the file, 0 if not     
set write_v 1           ;# compiled structural Verilog file
1
set write_ddc 1         ;# compiled file in ddc format (XG-mode)
1
set write_sdf 1         ;# sdf file for back-annotated timing sim
1
set write_sdc 1         ;# sdc constraint file for place and route
1
set write_rep 1         ;# report file from compilation
1
set write_pow 1         ;# report file for power estimate
1
set write_ref 1         ;# report file for power estimate
1
# compiler switches...                  
set useUltra 0                      ;# 1 for compile_ultra, 0 for compile
0
# mapEffort, useUngroup are for    
# non-ultra compile...         
set mapEffort1      low            ;# First pass - low, medium, or high
low
set mapEffort2      low            ;# second pass - low, medium, or high
low
set useUngroup 0                    ;# 0 if no flatten, 1 if flatten
0
#*********************************************************
#*   below here shouldn't need to be changed...          *
#*********************************************************
# analyze and elaborate the files 
analyze -format $fileFormat -lib WORK $myFiles
Running PRESTO HDLC
Compiling source file ./rtl/and_func.sv
Presto compilation completed successfully.
Loading db file '/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library/synopsys/models/saed90nm_typ.db'
Loading db file '/sim/synopsys64/icc/libraries/syn/dw_foundation.sldb'
1
elaborate $basename -lib WORK -update
Loading db file '/sim/synopsys64/icc/libraries/syn/gtech.db'
Loading db file '/sim/synopsys64/icc/libraries/syn/standard.sldb'
  Loading link library 'saed90nm_typ'
  Loading link library 'gtech'
Running PRESTO HDLC
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'and_func'.
1
current_design $basename
Current design is 'and_func'.
{and_func}
# The link command makes sure that all the required design 
# parts are linked together.                   
# The uniquify command makes unique copies of replicated   
# modules.                          
link

  Linking design 'and_func'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  and_func                    /home/kbhardwaj/4340_files/synthesis_results/and_func.db
  saed90nm_typ (library)      /sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library/synopsys/models/saed90nm_typ.db
  dw_foundation.sldb (library) /sim/synopsys64/icc/libraries/syn/dw_foundation.sldb

1
uniquify
1
# now you can create clocks for the design                 
# and set other constraints                                
if {  $virtual == 0 } {
   #create_clock -period $clkPeriod_ns $CLK
} else {
   #create_clock -period $clkPeriod_ns -name $CLK
}
# Set the driving cell for all inputs except the clock     
# The clock has infinite drive by default. This is usually  
# what you want for synthesis because you will use other   
# tools (like SOC Encounter) to build the clock tree        
# (or define it by hand).              
if {  $virtual == 0 } {
    #set_driving_cell  -lib_cell $inputDrive [all_inputs] } else {
   #set_driving_cell  -library $LoadLib -lib_cell $inputDrive           [remove_from_collection [all_inputs] $CLK]
}
# set the input and output delay relative to CLK         
if {  $virtual == 0 } {
   # set_input_delay $inDelay_ns -clock $CLK [all_inputs] } else {
    #set_input_delay $inDelay_ns -clock $CLK      [remove_from_collection [all_inputs] $CLK]
}
#set_output_delay $outDelay_ns -clock $CLK [all_outputs]
# set the load of the circuit outputs in terms of the load 
# of the next cell that they will drive, also try to fix   
# hold time issues                     
#set_load [load_of [format "%s%s%s%s%s" $LoadLib "/" $inputDrive "/" $myLoadPin]] [all_outputs]
set set_load 13
13
#set_fix_hold $CLK
# This command will fix the problem of having             
# assign statements left in your structural file.         
# But, it will insert pairs of inverters for feedthroughs!
#set_fix_multiple_port_nets -all -buffer_constants
#   
check_design
1
##################################################################
# Check for design errors
# Designer should examine log file, look for:
#   - inferred latches not in syn.lib
#   -  fanout nets other than clk
##################################################################
# now compile the design with given mapping effort        
# and do a second compile with incremental mapping        
# or use the compile_ultra meta-command        
if {  $useUltra == 1 } {
   compile_ultra
} else {
   if {  $useUngroup == 1 } {
     compile -ungoup_all -map_effort $mapEffort1
     compile -incremental_mapping -map_effort $mapEffort2
  } else {
     compile -map_effort $mapEffort1
     compile -incremental_mapping -map_effort $mapEffort2
  }
}
Warning: The compile -map_effort low is obsolete. Setting this variable now defaults to compile -map_effort medium. Please update your script accordingly. (OPT-1303)
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | F-2011.09-DWBB_201109.2 |     *     |
| Licensed DW Building Blocks        | F-2011.09-DWBB_201109.2 |           |
============================================================================



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'and_func'

  Updating timing information
Information: Updating design information... (UID-85)
Information: Design 'and_func' has no optimization constraints set. (OPT-108)

  Beginning Mapping Optimizations  (Medium effort)
  -------------------------------
  Structuring 'and_func'
  Mapping 'and_func'

  Beginning Delay Optimization Phase
  ----------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
Loading db file '/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library/synopsys/models/saed90nm_typ.db'

  Optimization Complete
  ---------------------
Warning: The compile -map_effort low is obsolete. Setting this variable now defaults to compile -map_effort medium. Please update your script accordingly. (OPT-1303)


  Beginning Pass 1 Mapping  (Incremental)
  ------------------------

  Updating timing information
Information: Updating design information... (UID-85)
Information: Design 'and_func' has no optimization constraints set. (OPT-108)

  Beginning Mapping Optimizations  (Medium effort)  (Incremental)
  -------------------------------

  Beginning Incremental Implementation Selection
  ----------------------------------------------

  Beginning Delay Optimization Phase
  ----------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
    0:00:01       7.6      0.00       0.0       0.0                          
Loading db file '/sim/synopsys/SAED_EDK90nm/Digital_Standard_Cell_Library/synopsys/models/saed90nm_typ.db'

  Optimization Complete
  ---------------------
1
report_constraint -all_violators
Information: Updating design information... (UID-85)
 
****************************************
Report : constraint
        -all_violators
Design : and_func
Version: F-2011.09-SP2
Date   : Wed Oct  8 19:10:06 2014
****************************************

This design has no violated constraints.

1
#************************************************************
#* now write out the results                                *
#************************************************************
set filebase [format "%s%s" [format "%s%s" $basename "_"] $STAGE] 
and_func_synth
# structural (synthesized) file as verilog                 
if {  $write_v == 1 } {
    set filename [format "%s%s" $filebase ".v"]
    write -format verilog -hierarchy -output $filename
}
Writing verilog file '/home/kbhardwaj/4340_files/synthesis_results/and_func_synth.v'.
1
# write out the sdf file for back-annotated verilog sim    
# This file can be large!                   
if {  $write_sdf == 1 } {
    set filename [format "%s%s" $filebase ".sdf"]
    write_sdf -version 1.0 $filename
}
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/kbhardwaj/4340_files/synthesis_results/and_func_synth.sdf'. (WT-3)
1
# this is the timing constraints file generated from the   
# conditions above - used in the place and route program   
if {  $write_sdc == 1 } {
    set filename [format "%s%s" $filebase ".sdc"]
    write_sdc $filename
}
1
# synopsys database format in case you want to read this               
# synthesized result back in to synopsys later in XG mode (ddc format) 
if {  $write_ddc == 1 } {
    set filename [format "%s%s" $filebase ".ddc"]
    write -format ddc -hierarchy -output $filename
    set mw_filename [format "%s%s" $filebase "_DCT"]
    write_milkyway -overwrite -output $mw_filename
}
Writing ddc file 'and_func_synth.ddc'.
1
# report on the results from synthesis                     
# note that > makes a new file and >> appends to a file    
if {  $write_rep == 1 } {
    set filename [format "%s%s" $filebase ".rep"]
    redirect $filename { report_timing }
    redirect -append $filename { report_area }
}
# report the power estimate from synthesis.             
if {  $write_pow == 1 } {
    set filename [format "%s%s" $filebase ".pow"]
    redirect $filename { report_power }
}
if {  $write_ref == 1 } {
    set filename [format "%s%s" $filebase ".ref"]
    redirect $filename { report_reference -nosplit -hierarchy }
}
quit

Thank you...
